ИмпортВБанк/src/ExternalDataProcessors/ИмпортВБанк/ИмпортВБанк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ИмпортВБанк</name>
  <tabularSections>
    <name>ТЧ</name>
    <attributes>
      <name>ИндентификаторКонтрагента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>60</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КБК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОКТМО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>8</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

ИмпортВБанк/src/ExternalDataProcessors/ИмпортВБанк/Forms/Форма/Module.bsl
Процедура ЗаполнитьСписокБанков()
	PSB =РеквизитФормыВЗначение("Объект").ПолучитьМакет("PSB");
	Sbr = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Sbr");
	КартинкаPSB=Новый Картинка(PSB);
	КартинкаSbr=Новый Картинка(Sbr);
	Элементы.Банк.СписокВыбора.Добавить("ПСБ","Промсвязьбанк" , ,КартинкаPSB);
	Элементы.Банк.СписокВыбора.Добавить("Сбербанк", , , КартинкаSbr);
КонецПроцедуры

Процедура ЗаполнитьСписокУслуг()
	Если Услуги.Количество()=0 Тогда
		Услуги.Добавить("8251432", "Командировочные расходы");
		Услуги.Добавить("8251401", "Прочие поступления денежных средств компенсации затрат федерального бюджета");
		Услуги.Добавить("8251402", "Возмещение причиненного военному имуществу ущерба");
		Услуги.Добавить("8251403", "Возмещение причиненного военному имуществу ущерба, возникшего до 01.01.2020");
		Услуги.Добавить("8251404", "Штрафы за нарушение законодательства в области обеспечения санитарно-эпидемиологического благополучия населения");
		Услуги.Добавить("8251405", "штрафы, за административные правонарушения в области дорожного движения");
		Услуги.Добавить("8251454", "штрафы, за административные правонарушения в области дорожного движения, выписанные до 01.01.2020");
		Услуги.Добавить("8251406", "родительская плата за содержание детей в ДОУ");
		Услуги.Добавить("8251441", "заработная плата гражданского персонала (национальная оборона)");
		Услуги.Добавить("8251442", "заработная плата гражданского персонала (ДОУ)");
		Услуги.Добавить("8251443", "заработная плата гражданского персонала (учреждений культуры)");
		Услуги.Добавить("8251444", "заработная плата гражданского персонала (СЭС)");
		Услуги.Добавить("8251445", "заработная плата гражданского персонала (медицина)");
		Услуги.Добавить("8251446", "пособия гражданского персонала (национальная оборона)");
		Услуги.Добавить("8251447", "пособия гражданского персонала (ДОУ)");
		Услуги.Добавить("8251448", "пособия гражданского персонала (учреждений культуры)");
	КонецЕсли;
	Если Услуги.ОтметитьЭлементы("Выберите услсугу") Тогда
		СписокУслуг="";
		Для каждого Услуга Из Услуги Цикл
			Если НЕ Услуга.Пометка Тогда
				Продолжить;
			КонецЕсли;
			Если ПустаяСтрока(СписокУслуг) Тогда
				СписокУслуг=Услуга.Значение;
			Иначе
				СписокУслуг=СписокУслуг+", "+Услуга.Значение;
			КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	Для каждого Услуга из Услуги Цикл
		Если Услуга.Пометка Тогда
			ЗаполнитьТЧНаСервере(Услуга.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьЛичныйНомерВС(Контрагент)
	ДопРекв=УправлениеСвойствами.ПолучитьЗначенияСвойств(Контрагент);
	Для каждого рекв из ДопРекв Цикл 
		если рекв.свойство=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Личный номер в/с") Тогда 
			Возврат рекв.Значение;
		КонецЕсли;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеСведения.Значение
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ДополнительныеСведения.Объект = &Объект
		|	И ДополнительныеСведения.Свойство = &Свойство";
	
	Запрос.УстановитьПараметр("Объект", контрагент);
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Личный номер в/с"));
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	если РезультатЗапроса.Количество()=1 Тогда 
		Возврат РезультатЗапроса[0].Значение;
	Иначе 
		Возврат "";
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ЗаполнитьТЧНаСервере(ВидУслуги)
	Объект.ТЧ.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЖурналПроводокЕПСБУОстатки.Субконто1 КАК Контрагент,
		|	ЖурналПроводокЕПСБУОстатки.КПС,
		|	ЖурналПроводокЕПСБУОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки КАК ЖурналПроводокЕПСБУОстатки
		|ГДЕ
		|	ЖурналПроводокЕПСБУОстатки.Счет В Иерархии(&Счет) И
		|   ЖурналПроводокЕПСБУОстатки.КПС =&КПС";
		
	Счет =Новый Массив;
	Счет.Добавить(ПланыСчетов.ЕПСБУ.НайтиПоКоду("205.31"));
	Запрос.УстановитьПараметр("Счет", Счет);
	КПС=Справочники.КлассификационныеПризнакиСчетов.НайтиПоКоду("11301991010300130");
	КПС_ГП=Справочники.КлассификационныеПризнакиСчетов.НайтиПоКоду("11301991010300130");
	Запрос.УстановитьПараметр("КПС", КПС);
	ТЗОстатки=Запрос.Выполнить().Выгрузить();
	ТЗОстаткиСвернутые=ТЗОстатки.Скопировать();
	ТЗОстаткиСвернутые.Свернуть("Контрагент,КПС","СуммаОстаток");
	
	Для Каждого Выборка из ТЗОстаткиСвернутые Цикл
		//Сумма остаток может оказаться нулевой в случае когда висит дебиторка по одному счету и кредиторка под другому
		//пропускаем такие случаи
		если выборка.СуммаОстаток<=0 Тогда 
			продолжить;
		КонецЕсли;
		НоваяСтр=Объект.ТЧ.Добавить();
		ФизЛицо=Выборка.Контрагент.ЮридическоеФизическоеЛицо;
		Если Выборка.КПС=КПС_ГП Тогда 
			НоваяСтр.ИндентификаторКонтрагента=ФизЛицо.СтраховойНомерПФР;
		Иначе 
			НоваяСтр.ИндентификаторКонтрагента=ПолучитьЛичныйНомерВС(Выборка.Контрагент);
		КонецЕсли;
		
		НоваяСтр.Контрагент=Выборка.Контрагент;
		Отбор=новый Структура;
		Отбор.Вставить("ФизическоеЛицо",ФизЛицо);
		ФИО=РегистрыСведений.ФИОФизическихЛиц.Выбрать(,,Отбор);
		Пока ФИО.Следующий() Цикл 
			НоваяСтр.Фамилия=Лев(СокрЛП(ФИО.Фамилия),1)+".";
			НоваяСтр.Имя=СокрЛП(ФИО.Имя);
			НоваяСтр.Отчество=СокрЛП(ФИО.Отчество);
		КонецЦикла;
		//26.08.2019 сумма должна выгружаться без пробела
		НоваяСтр.Сумма=Формат(Выборка.СуммаОстаток,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0");
		НоваяСтр.КБК="187"+Выборка.КПС.Код;
		НоваяСтр.ОКТМО="76701000";
	КонецЦикла;
	Объект.ТЧ.Сортировать("Фамилия,Имя,Отчество");
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	ТекстовыйФайл = Новый ТекстовыйДокумент;
		Для каждого стр из Объект.ТЧ Цикл 
			Если ПустаяСтрока(стр.ИндентификаторКонтрагента) или ПустаяСтрока(стр.Фамилия) или ПустаяСтрока(стр.Имя) или ПустаяСтрока(стр.Отчество) Тогда 
				Сообщить("Внимательно проверьте таблицу, в ней присутствуют строки с пустым Индентификатором или ФИО. Выгрузка отменена");
				Возврат;
			КонецЕсли;
			НоваяСтрока=стр.ИндентификаторКонтрагента+";"+стр.Фамилия+ " "+ стр.Имя+" " + стр.Отчество+" ;"+стр.КБК+";"+стр.ОКТМО+";"+стр.Сумма+";";
			ТекстовыйФайл.ДобавитьСтроку(НоваяСтрока);
		КонецЦикла;
		Попытка
			ТекстовыйФайл.Записать(Путь,"windows-1251");
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокБанков();	
	Путь="F:\1С\В банк\";
КонецПроцедуры



&НаКлиенте
Процедура СписокУслугНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЗаполнитьСписокУслуг();
КонецПроцедуры
